In [1]:
import pandas as pd

In [28]:
# initial_data = [
#     {'id': 1, 'firstname': 'Manuel', 'lastname': 'Wiedenmann', 'balance': 50.0},
# ]
accounts = pd.DataFrame(columns=['id', 'firstname', 'lastname', 'balance'])


data = [
    {'id': 1, 'firstname': 'Manuel', 'lastname': 'Wiedenmann', 'balance': 50.0},
    {'id': 2, 'firstname': 'Matthias', 'lastname': 'Rettenmeier', 'balance': 100.0},
    {'id': 3, 'firstname': 'Matthias', 'lastname': 'Rettenmeier', 'balance': 20.0},
]

for value in data:
    accounts = accounts.append(value, ignore_index=True)

accounts.to_csv('../data/bank/accounts.csv')

In [29]:
accounts.head()

  id firstname     lastname  balance
0  1    Manuel   Wiedenmann     50.0
1  2  Matthias  Rettenmeier    100.0
2  3  Matthias  Rettenmeier     20.0

In [30]:
accounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
id           3 non-null object
firstname    3 non-null object
lastname     3 non-null object
balance      3 non-null float64
dtypes: float64(1), object(3)
memory usage: 176.0+ bytes

In [31]:
accounts.index

RangeIndex(start=0, stop=3, step=1)

In [32]:
accounts.shape

(3, 4)

In [7]:
accounts.columns

Index(['id', 'firstname', 'lastname', 'balance'], dtype='object')

In [8]:
accounts.dtypes

id            object
firstname     object
lastname      object
balance      float64
dtype: object

In [9]:
accounts['id']

0    1
1    2
2    3
Name: id, dtype: object

In [10]:
accounts['firstname']

0      Manuel
1    Matthias
2    Matthias
Name: firstname, dtype: object

In [11]:
accounts['lastname']

0     Wiedenmann
1    Rettenmeier
2    Rettenmeier
Name: lastname, dtype: object

In [12]:
accounts['balance']

0     50.0
1    100.0
2     20.0
Name: balance, dtype: float64

In [13]:
accounts.describe()

          balance
count    3.000000
mean    56.666667
std     40.414519
min     20.000000
25%     35.000000
50%     50.000000
75%     75.000000
max    100.000000

In [14]:
accounts['id'] = accounts['id'].astype('int')

In [16]:
accounts.dtypes

id             int64
firstname     object
lastname      object
balance      float64
dtype: object

In [17]:
accounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
id           3 non-null int64
firstname    3 non-null object
lastname     3 non-null object
balance      3 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 176.0+ bytes

In [18]:
accounts.describe()

        id     balance
count  3.0    3.000000
mean   2.0   56.666667
std    1.0   40.414519
min    1.0   20.000000
25%    1.5   35.000000
50%    2.0   50.000000
75%    2.5   75.000000
max    3.0  100.000000

In [19]:
accounts

   id firstname     lastname  balance
0   1    Manuel   Wiedenmann     50.0
1   2  Matthias  Rettenmeier    100.0
2   3  Matthias  Rettenmeier     20.0

## Transactions

In [20]:
import datetime
import random
import time
import uuid

In [33]:
def random_timestamp():
    days = random.randint(1,365)
    now = datetime.datetime.utcnow()
    delta = datetime.timedelta(days=days)
    return now - delta

def short_uuid():
    return str(uuid.uuid4())[:8]

In [62]:
initial_data = [
    {'id': short_uuid(), 'sender_id': 3, 'recipient_id': 2, 'amount': 15.0, 'subject': '', 'category': '', 'timestamp': random_timestamp()},
]
    
transactions = pd.DataFrame(data=initial_data, columns=['id', 'sender_id', 'recipient_id', 'amount', 'subject', 'category', 'timestamp'])

data = [
    {'id': short_uuid(), 'sender_id': 1, 'recipient_id': 2, 'amount': 10.0, 'subject': '', 'category': '', 'timestamp': random_timestamp()},
    {'id': short_uuid(), 'sender_id': 1, 'recipient_id': 3, 'amount': 5.0, 'subject': '', 'category': '', 'timestamp': random_timestamp()},
    {'id': short_uuid(), 'sender_id': 2, 'recipient_id': 1, 'amount': 20.0, 'subject': '', 'category': '', 'timestamp': random_timestamp()},
    {'id': short_uuid(), 'sender_id': 3, 'recipient_id': 1, 'amount': 20.0, 'subject': '', 'category': '', 'timestamp': random_timestamp()},
]

for value in data:
    transactions = transactions.append(value, ignore_index=True)
    
accounts.to_csv('../data/bank/transactions.csv')

In [63]:
transactions

,id,sender_id,recipient_id,amount,subject,category,timestamp
0,236853f1,3,2,15.0,,,2018-04-15 09:49:30.806573
1,00cc9200,1,2,10.0,,,2018-10-18 09:49:30.808329
2,4ee6b26f,1,3,5.0,,,2018-08-09 09:49:30.808394
3,04ffca4b,2,1,20.0,,,2018-03-22 09:49:30.808440
4,b8036f78,3,1,20.0,,,2018-04-23 09:49:30.808466

In [61]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
id              4 non-null object
sender_id       4 non-null object
recipient_id    4 non-null object
amount          4 non-null float64
subject         4 non-null object
category        4 non-null object
timestamp       4 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 304.0+ bytes

In [39]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
id              5 non-null object
sender_id       5 non-null int64
recipient_id    5 non-null int64
amount          5 non-null float64
subject         5 non-null object
category        5 non-null object
timestamp       5 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 360.0+ bytes

In [49]:
list1 = [1,2,3]

In [50]:
list2 = [4,5,6]

In [51]:
list3 = list1 + list2
print(list3)

[1, 2, 3, 4, 5, 6]

In [65]:
transactions.describe()

       sender_id  recipient_id     amount
count        5.0       5.00000   5.000000
mean         2.0       1.80000  14.000000
std          1.0       0.83666   6.519202
min          1.0       1.00000   5.000000
25%          1.0       1.00000  10.000000
50%          2.0       2.00000  15.000000
75%          3.0       2.00000  20.000000
max          3.0       3.00000  20.000000

In [68]:
transactions.sort_values('amount')

,id,sender_id,recipient_id,amount,subject,category,timestamp
2,4ee6b26f,1,3,5.0,,,2018-08-09 09:49:30.808394
1,00cc9200,1,2,10.0,,,2018-10-18 09:49:30.808329
0,236853f1,3,2,15.0,,,2018-04-15 09:49:30.806573
3,04ffca4b,2,1,20.0,,,2018-03-22 09:49:30.808440
4,b8036f78,3,1,20.0,,,2018-04-23 09:49:30.808466

In [69]:
transactions

,id,sender_id,recipient_id,amount,subject,category,timestamp
0,236853f1,3,2,15.0,,,2018-04-15 09:49:30.806573
1,00cc9200,1,2,10.0,,,2018-10-18 09:49:30.808329
2,4ee6b26f,1,3,5.0,,,2018-08-09 09:49:30.808394
3,04ffca4b,2,1,20.0,,,2018-03-22 09:49:30.808440
4,b8036f78,3,1,20.0,,,2018-04-23 09:49:30.808466

### .loc[]

http://pandas.pydata.org/pandas-docs/version/0.24/reference/api/pandas.DataFrame.loc.html

> **Warning** Note that contrary to usual python slices, both the start and the stop are included

In [70]:
# Gibt uns die Liste aller amounts
transactions.loc[:, 'amount'] # äquivalent zu transactions['amount']

0    15.0
1    10.0
2     5.0
3    20.0
4    20.0
Name: amount, dtype: float64

In [71]:
# Gibt uns die Liste der ersten zwei amounts
transactions.loc[0:1, 'amount']

0    15.0
1    10.0
Name: amount, dtype: float64

In [72]:
# Gibt uns die Liste der letzten zwei amounts
transactions.loc[3:4, 'amount']

3    20.0
4    20.0
Name: amount, dtype: float64

In [73]:
# Gibt uns die Liste ab dem 2. bis zum 4. amount
transactions.loc[1:3, 'amount']

1    10.0
2     5.0
3    20.0
Name: amount, dtype: float64

In [74]:
# Gibt uns die Liste ab dem 3. amount bis zum Ende
transactions.loc[2:, 'amount']

2     5.0
3    20.0
4    20.0
Name: amount, dtype: float64

In [75]:
# Gibt uns die Liste vom Anfang bis zum 4. amount
transactions.loc[:3, 'amount']

0    15.0
1    10.0
2     5.0
3    20.0
Name: amount, dtype: float64

## .loc[] als Filter

In [76]:
# Gibt uns die Anzahl aller Transaktionen mit dem amount == 20
len(transactions.loc[transactions['amount'] == 20])

2

In [77]:
# Gibt uns die rows/Transaktionen mit dem amount == 20
transactions.loc[transactions['amount'] == 20]

,id,sender_id,recipient_id,amount,subject,category,timestamp
3,04ffca4b,2,1,20.0,,,2018-03-22 09:49:30.808440
4,b8036f78,3,1,20.0,,,2018-04-23 09:49:30.808466

In [78]:
# Gibt uns die Anzahl aller Transactionen mit dem amount < 20
len(transactions.loc[transactions['amount'] < 20])

3

In [79]:
transactions.loc[transactions['amount'] < 20]

,id,sender_id,recipient_id,amount,subject,category,timestamp
0,236853f1,3,2,15.0,,,2018-04-15 09:49:30.806573
1,00cc9200,1,2,10.0,,,2018-10-18 09:49:30.808329
2,4ee6b26f,1,3,5.0,,,2018-08-09 09:49:30.808394

In [80]:
# Gibt uns die Anzahl aller Transactionen mit dem amount == 7
len(transactions.loc[transactions['amount'] == 7])

0

In [81]:
transactions.loc[transactions['amount'] == 7]

Empty DataFrame
Columns: [id, sender_id, recipient_id, amount, subject, category, timestamp]
Index: []